NguyenPhiHao/RL78F25/Sample_App_Lin/QINeS_MCAL/src/Mcal/Can/include/Can_70_RL78F2X_HwReg.h
/******************************************************************************/
/* Copyright   :                                                              */
/* System Name : AUTOSAR MCAL                                                 */
/* File Name   : Can_70_RL78F2X_HwReg.h                                       */
/* Version     : v1.00.01                                                     */
/* Contents    : This module provides services for initiating transmissions   */
/*               and calls the callback functions of the CanIf module for     */
/*               notifying events, independently from the hardware. Also it   */
/*               provides services to control the behavior and state of the   */
/*               CAN controllers that belong to the same CAN Hardware Unit.   */
/* Author      : --                                                           */
/* Note        : --                                                           */
/* History     : --                                                           */
/******************************************************************************/
/* Specification of CAN Driver                                                */
/* R22-11                                                                     */
#ifndef CAN_70_RL78F2X_HWREG_H
#define CAN_70_RL78F2X_HWREG_H

/*----------------------------------------------------------------------------*/
/* include headers                                                            */
/*----------------------------------------------------------------------------*/
#include "Can_70_RL78F2X_HwReg_Dep.h"
#include "QINeS_Lite.h"

/*----------------------------------------------------------------------------*/
/* file version information                                                   */
/*----------------------------------------------------------------------------*/
#define CAN_70_VENDOR_ID_RL78F2X_HWREG_H                           ( 70U )
#define CAN_70_MODULE_ID_RL78F2X_HWREG_H                           ( 80U )

#define CAN_70_AR_RELEASE_MAJOR_VERSION_RL78F2X_HWREG_H            ( 22U )
#define CAN_70_AR_RELEASE_MINOR_VERSION_RL78F2X_HWREG_H            ( 11U )
#define CAN_70_AR_RELEASE_REVISION_VERSION_RL78F2X_HWREG_H         (  0U )

#define CAN_70_SW_MAJOR_VERSION_RL78F2X_HWREG_H                    (  1U )
#define CAN_70_SW_MINOR_VERSION_RL78F2X_HWREG_H                    (  0U )
#define CAN_70_SW_PATCH_VERSION_RL78F2X_HWREG_H                    (  0U )

/*----------------------------------------------------------------------------*/
/* file version checks                                                        */
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/* type definitions                                                           */
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/* macros                                                                     */
/*----------------------------------------------------------------------------*/

/* See chapter F24(18.3.1) / F25(19.3.1) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_C0NCFGH_NTSEG2        ( ( uint16 )0xFE00U )
#define CAN_70_RL78F2X_MASK_C0NCFGH_NTSEG1        ( ( uint16 )0x01FEU )
#define CAN_70_RL78F2X_MASK_C0NCFGH_NSJW          ( ( uint16 )0x0001U )
#define CAN_70_RL78F2X_MASK_C0NCFGL_NSJW          ( ( uint16 )0xFC00U )
#define CAN_70_RL78F2X_MASK_C0NCFGL_NBRP          ( ( uint16 )0x03FFU )

/* See chapter F24(18.3.2) / F25(19.3.2) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_C0CTRH_ROM            ( ( uint16 )0x8000U )
#define CAN_70_RL78F2X_MASK_C0CTRH_BFT            ( ( uint16 )0x4000U )
#define CAN_70_RL78F2X_MASK_C0CTRH_CTMS           ( ( uint16 )0x0600U )
#define CAN_70_RL78F2X_MASK_C0CTRH_CTME           ( ( uint16 )0x0100U )
#define CAN_70_RL78F2X_MASK_C0CTRH_ERRD           ( ( uint16 )0x0080U )
#define CAN_70_RL78F2X_MASK_C0CTRH_BOM            ( ( uint16 )0x0060U )
#define CAN_70_RL78F2X_MASK_C0CTRH_TDCVFIE        ( ( uint16 )0x0008U )
#define CAN_70_RL78F2X_MASK_C0CTRH_SOCOIE         ( ( uint16 )0x0004U )
#define CAN_70_RL78F2X_MASK_C0CTRH_EOCOIE         ( ( uint16 )0x0002U )
#define CAN_70_RL78F2X_MASK_C0CTRH_TAIE           ( ( uint16 )0x0001U )
#define CAN_70_RL78F2X_MASK_C0CTRL_ALIE           ( ( uint16 )0x8000U )
#define CAN_70_RL78F2X_MASK_C0CTRL_BLIE           ( ( uint16 )0x4000U )
#define CAN_70_RL78F2X_MASK_C0CTRL_OLIE           ( ( uint16 )0x2000U )
#define CAN_70_RL78F2X_MASK_C0CTRL_BORIE          ( ( uint16 )0x1000U )
#define CAN_70_RL78F2X_MASK_C0CTRL_BOEIE          ( ( uint16 )0x0800U )
#define CAN_70_RL78F2X_MASK_C0CTRL_EPIE           ( ( uint16 )0x0400U )
#define CAN_70_RL78F2X_MASK_C0CTRL_EWIE           ( ( uint16 )0x0200U )
#define CAN_70_RL78F2X_MASK_C0CTRL_BEIE           ( ( uint16 )0x0100U )
#define CAN_70_RL78F2X_MASK_C0CTRL_RTBO           ( ( uint16 )0x0008U )
#define CAN_70_RL78F2X_MASK_C0CTRL_CSLPR          ( ( uint16 )0x0004U )
#define CAN_70_RL78F2X_MASK_C0CTRL_CHMDC          ( ( uint16 )0x0003U )

/* See chapter F24(18.3.3) / F25(19.3.3) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_C0STSH_TEC            ( ( uint16 )0xFF00U )
#define CAN_70_RL78F2X_MASK_C0STSH_REC            ( ( uint16 )0x00FFU )
#define CAN_70_RL78F2X_MASK_C0STSL_COMSTS         ( ( uint16 )0x0080U )
#define CAN_70_RL78F2X_MASK_C0STSL_BOSTS          ( ( uint16 )0x0010U )
#define CAN_70_RL78F2X_MASK_C0STSL_EPSTS          ( ( uint16 )0x0008U )
#define CAN_70_RL78F2X_MASK_C0STSL_CSLPSTS        ( ( uint16 )0x0004U )
#define CAN_70_RL78F2X_MASK_C0STSL_CHLTSTS        ( ( uint16 )0x0002U )
#define CAN_70_RL78F2X_MASK_C0STSL_CRSTSTS        ( ( uint16 )0x0001U )

/* See chapter F24(18.3.4) / F25(19.3.4) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_C0ERFLL_ADERR         ( ( uint16 )0x4000U )
#define CAN_70_RL78F2X_MASK_C0ERFLL_B0ERR         ( ( uint16 )0x2000U )
#define CAN_70_RL78F2X_MASK_C0ERFLL_B1ERR         ( ( uint16 )0x1000U )
#define CAN_70_RL78F2X_MASK_C0ERFLL_CERR          ( ( uint16 )0x0800U )
#define CAN_70_RL78F2X_MASK_C0ERFLL_AERR          ( ( uint16 )0x0400U )
#define CAN_70_RL78F2X_MASK_C0ERFLL_FERR          ( ( uint16 )0x0200U )
#define CAN_70_RL78F2X_MASK_C0ERFLL_SERR          ( ( uint16 )0x0100U )
#define CAN_70_RL78F2X_MASK_C0ERFLL_ALF           ( ( uint16 )0x0080U )
#define CAN_70_RL78F2X_MASK_C0ERFLL_BLF           ( ( uint16 )0x0040U )
#define CAN_70_RL78F2X_MASK_C0ERFLL_OVLF          ( ( uint16 )0x0020U )
#define CAN_70_RL78F2X_MASK_C0ERFLL_BORF          ( ( uint16 )0x0010U )
#define CAN_70_RL78F2X_MASK_C0ERFLL_BOEF          ( ( uint16 )0x0008U )
#define CAN_70_RL78F2X_MASK_C0ERFLL_EPF           ( ( uint16 )0x0004U )
#define CAN_70_RL78F2X_MASK_C0ERFLL_EWF           ( ( uint16 )0x0002U )
#define CAN_70_RL78F2X_MASK_C0ERFLL_BEF           ( ( uint16 )0x0001U )

/* See chapter F24(18.3.5) / F25(19.3.5) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_C0DCFGH_DSJW          ( ( uint16 )0x0F00U )
#define CAN_70_RL78F2X_MASK_C0DCFGH_DTSEG2        ( ( uint16 )0x000FU )
#define CAN_70_RL78F2X_MASK_C0DCFGL_DTSEG1        ( ( uint16 )0x1F00U )
#define CAN_70_RL78F2X_MASK_C0DCFGL_DBRP          ( ( uint16 )0x00FFU )

