NguyenPhiHao/RL78F25/Sample_App_Lin/QINeS_MCAL/src/Mcal/Can/include/Can_70_RL78F2X_HwReg.h
/* See chapter F24(18.3.6) / F25(19.3.6) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_C0FDCFGH_CLOE         ( ( uint16 )0x4000U )
#define CAN_70_RL78F2X_MASK_C0FDCFGH_REFE         ( ( uint16 )0x2000U )
#define CAN_70_RL78F2X_MASK_C0FDCFGH_FDOE         ( ( uint16 )0x1000U )
#define CAN_70_RL78F2X_MASK_C0FDCFGH_TDCO         ( ( uint16 )0x00FFU )
#define CAN_70_RL78F2X_MASK_C0FDCFGL_RPNMD        ( ( uint16 )0x3000U )
#define CAN_70_RL78F2X_MASK_C0FDCFGL_ESIC         ( ( uint16 )0x0400U )
#define CAN_70_RL78F2X_MASK_C0FDCFGL_TDCE         ( ( uint16 )0x0200U )
#define CAN_70_RL78F2X_MASK_C0FDCFGL_TDCOC        ( ( uint16 )0x0100U )
#define CAN_70_RL78F2X_MASK_C0FDCFGL_EOCCFG       ( ( uint16 )0x0007U )

/* See chapter F24(18.3.11) / F25(19.3.11) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_GCFGH_ITRCP           ( ( uint16 )0xFFFFU )
#define CAN_70_RL78F2X_MASK_GCFGL_TSSS            ( ( uint16 )0x1000U )
#define CAN_70_RL78F2X_MASK_GCFGL_TSP             ( ( uint16 )0x0F00U )
#define CAN_70_RL78F2X_MASK_GCFGL_CMPOC           ( ( uint16 )0x0020U )
#define CAN_70_RL78F2X_MASK_GCFGL_DCS             ( ( uint16 )0x0010U )
#define CAN_70_RL78F2X_MASK_GCFGL_MME             ( ( uint16 )0x0008U )
#define CAN_70_RL78F2X_MASK_GCFGL_DRE             ( ( uint16 )0x0004U )
#define CAN_70_RL78F2X_MASK_GCFGL_DCE             ( ( uint16 )0x0002U )
#define CAN_70_RL78F2X_MASK_GCFGL_TPRI            ( ( uint16 )0x0001U )

/* See chapter F24(18.3.12) / F25(19.3.12) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_GCTRH_TSRST           ( ( uint16 )0x0001U )
#define CAN_70_RL78F2X_MASK_GCTRL_CMPOFIE         ( ( uint16 )0x0800U )
#define CAN_70_RL78F2X_MASK_GCTRL_THLEIE          ( ( uint16 )0x0400U )
#define CAN_70_RL78F2X_MASK_GCTRL_MEIE            ( ( uint16 )0x0200U )
#define CAN_70_RL78F2X_MASK_GCTRL_DEIE            ( ( uint16 )0x0100U )
#define CAN_70_RL78F2X_MASK_GCTRL_GSLPR           ( ( uint16 )0x0004U )
#define CAN_70_RL78F2X_MASK_GCTRL_GMDC            ( ( uint16 )0x0003U )

/* See chapter F24(18.3.13) / F25(19.3.13) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_GSTS_GRAMINIT         ( ( uint16 )0x0008U )
#define CAN_70_RL78F2X_MASK_GSTS_GSLPSTS          ( ( uint16 )0x0004U )
#define CAN_70_RL78F2X_MASK_GSTS_GHLTSTS          ( ( uint16 )0x0002U )
#define CAN_70_RL78F2X_MASK_GSTS_GRSTSTS          ( ( uint16 )0x0001U )

/* See chapter F24(18.3.14) / F25(19.3.14) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_GERFLH_EEF            ( ( uint16 )0x0001U )
#define CAN_70_RL78F2X_MASK_GERFLL_MES            ( ( uint16 )0x0002U )

/* See chapter F24(18.3.16) / F25(19.3.16) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_GTSC_TS               ( ( uint16 )0xFFFFU )

/* See chapter F24(18.3.17) / F25(19.3.17) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_GAFLECTR_AFLDAE       ( ( uint16 )0x0100U )

/* See chapter F24(18.3.18) / F25(19.3.18) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_GAFLCFG_RNC           ( ( uint16 )0x001FU )

/* See chapter F24(18.3.19) / F25(19.3.19) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_GAFLIDH_GAFLIDE       ( ( uint16 )0x8000U )
#define CAN_70_RL78F2X_MASK_GAFLIDH_GAFLRTR       ( ( uint16 )0x4000U )
#define CAN_70_RL78F2X_MASK_GAFLIDH_GAFLLB        ( ( uint16 )0x2000U )
#define CAN_70_RL78F2X_MASK_GAFLIDH_GAFLID        ( ( uint16 )0x1FFFU )
#define CAN_70_RL78F2X_MASK_GAFLIDL_GAFLID        ( ( uint16 )0xFFFFU )

/* See chapter F24(18.3.20) / F25(19.3.20) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_GAFLMH_GAFLIDEM       ( ( uint16 )0x8000U )
#define CAN_70_RL78F2X_MASK_GAFLMH_GAFLRTRM       ( ( uint16 )0x4000U )
#define CAN_70_RL78F2X_MASK_GAFLMH_GAFLIFL1       ( ( uint16 )0x2000U )
#define CAN_70_RL78F2X_MASK_GAFLMH_GAFLIDM_H      ( ( uint16 )0x1FFFU )
#define CAN_70_RL78F2X_MASK_GAFLML_GAFLIDM_L      ( ( uint16 )0xFFFFU )

/* See chapter F24(18.3.21) / F25(19.3.21) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_GAFLP0H_GAFLPTR       ( ( uint16 )0xFFFFU )
#define CAN_70_RL78F2X_MASK_GAFLP0L_GAFLRMV       ( ( uint16 )0x8000U )
#define CAN_70_RL78F2X_MASK_GAFLP0L_GAFLRMDP      ( ( uint16 )0x1F00U )
#define CAN_70_RL78F2X_MASK_GAFLP0L_GAFLIFL0      ( ( uint16 )0x0080U )
#define CAN_70_RL78F2X_MASK_GAFLP0L_GAFLDLC       ( ( uint16 )0x000FU )

/* See chapter F24(18.3.22) / F25(19.3.22) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_GAFLP1L_GAFLFDP_1     ( ( uint16 )0x0100U )
#define CAN_70_RL78F2X_MASK_GAFLP1L_GAFLFDP_2     ( ( uint16 )0x0003U )

/* See chapter F24(18.3.25) / F25(19.3.25) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_RFCC_RFIM             ( ( uint16 )0x1000U )
#define CAN_70_RL78F2X_MASK_RFCC_RFDC             ( ( uint16 )0x0700U )
#define CAN_70_RL78F2X_MASK_RFCC_RFPLS            ( ( uint16 )0x0070U )
#define CAN_70_RL78F2X_MASK_RFCC_RFIE             ( ( uint16 )0x0002U )
#define CAN_70_RL78F2X_MASK_RFCC_RFE              ( ( uint16 )0x0001U )

/* See chapter F24(18.3.26) / F25(19.3.26) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_RFSTS_RFMC            ( ( uint16 )0x3F00U )
#define CAN_70_RL78F2X_MASK_RFSTS_RFIF            ( ( uint16 )0x0008U )
#define CAN_70_RL78F2X_MASK_RFSTS_RFMLT           ( ( uint16 )0x0004U )
#define CAN_70_RL78F2X_MASK_RFSTS_RFFLL           ( ( uint16 )0x0002U )
#define CAN_70_RL78F2X_MASK_RFSTS_RFEMP           ( ( uint16 )0x0001U )

/* See chapter F24(18.3.27) / F25(19.3.27) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_RFPCTR_RFPC           ( ( uint16 )0x00FFU )

/* See chapter F24(18.3.34) / F25(19.3.34) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_RFISTS_RF1IF          ( ( uint16 )0x0002U )
#define CAN_70_RL78F2X_MASK_RFISTS_RF0IF          ( ( uint16 )0x0001U )

/* See chapter F24(18.3.35) / F25(19.3.35) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_TMC_TMOM              ( ( uint8  )0x04U )
#define CAN_70_RL78F2X_MASK_TMC_TMTAR             ( ( uint8  )0x02U )
#define CAN_70_RL78F2X_MASK_TMC_TMTR              ( ( uint8  )0x01U )

