NguyenPhiHao/RL78F25/Sample_App_Lin/QINeS_MCAL/src/Mcal/Can/include/Can_70_RL78F2X_HwReg.h
/* See chapter F24(18.3.36) / F25(19.3.36) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_TMSTS_TMTARM          ( ( uint8  )0x10U )
#define CAN_70_RL78F2X_MASK_TMSTS_TMTRM           ( ( uint8  )0x08U )
#define CAN_70_RL78F2X_MASK_TMSTS_TMTRF           ( ( uint8  )0x06U )
#define CAN_70_RL78F2X_MASK_TMSTS_TMTSTS          ( ( uint8  )0x01U )

/* See chapter F24(18.3.41) / F25(19.3.41) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_TMIEC_TMIE3           ( ( uint16 )0x0008U )
#define CAN_70_RL78F2X_MASK_TMIEC_TMIE2           ( ( uint16 )0x0004U )
#define CAN_70_RL78F2X_MASK_TMIEC_TMIE1           ( ( uint16 )0x0002U )
#define CAN_70_RL78F2X_MASK_TMIEC_TMIE0           ( ( uint16 )0x0001U )

/* See chapter F24(18.3.42) / F25(19.3.42) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_THLCC_THLDTE          ( ( uint16 )0x0400U )
#define CAN_70_RL78F2X_MASK_THLCC_THLIM           ( ( uint16 )0x0200U )
#define CAN_70_RL78F2X_MASK_THLCC_THLIE           ( ( uint16 )0x0100U )
#define CAN_70_RL78F2X_MASK_THLCC_THLE            ( ( uint16 )0x0001U )

/* See chapter F24(18.3.43) / F25(19.3.43) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_THLSTS_THLMC          ( ( uint16 )0x0F00U )
#define CAN_70_RL78F2X_MASK_THLSTS_THLIF          ( ( uint16 )0x0008U )
#define CAN_70_RL78F2X_MASK_THLSTS_THLELT         ( ( uint16 )0x0004U )
#define CAN_70_RL78F2X_MASK_THLSTS_THLFLL         ( ( uint16 )0x0002U )
#define CAN_70_RL78F2X_MASK_THLSTS_THLEMP         ( ( uint16 )0x0001U )

/* See chapter F24(18.3.44) / F25(19.3.44) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_THLACC0H_TMTS         ( ( uint16 )0xFFFFU )
#define CAN_70_RL78F2X_MASK_THLACC0L_BN           ( ( uint16 )0x0018U )
#define CAN_70_RL78F2X_MASK_THLACC0L_BT           ( ( uint16 )0x0003U )

/* See chapter F24(18.3.46) / F25(19.3.46) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_THLPCTR_THLPC         ( ( uint16 )0x00FFU )

/* See chapter F24(18.3.50) / F25(19.3.50) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_GFDCFG_TSCCFG         ( ( uint16 )0x0300U )
#define CAN_70_RL78F2X_MASK_GFDCFG_RPED           ( ( uint16 )0x0001U )

/* See chapter F24(18.3.67) / F25(19.3.67) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_CFDGRWC_KEY           ( ( uint16 )0xFF00U )
#define CAN_70_RL78F2X_MASK_CFDGRWC_RPAGE         ( ( uint16 )0x0003U )

/* See chapter F24(18.5.5) / F25(19.5.5) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_RFIDH_RFIDE           ( ( uint16 )0x8000U )
#define CAN_70_RL78F2X_MASK_RFIDH_RFRTR           ( ( uint16 )0x4000U )
#define CAN_70_RL78F2X_MASK_RFIDH_RFID            ( ( uint16 )0x1FFFU )
#define CAN_70_RL78F2X_MASK_RFIDL_RFID            ( ( uint16 )0xFFFFU )

/* See chapter F24(18.5.7) / F25(19.5.7) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_RFFDSTSH_RFPTR        ( ( uint16 )0xFFFFU )
#define CAN_70_RL78F2X_MASK_RFFDSTSL_RFIFL        ( ( uint16 )0x0300U )
#define CAN_70_RL78F2X_MASK_RFFDSTSL_RFFDF        ( ( uint16 )0x0004U )
#define CAN_70_RL78F2X_MASK_RFFDSTSL_RFBRS        ( ( uint16 )0x0002U )
#define CAN_70_RL78F2X_MASK_RFFDSTSL_RFESI        ( ( uint16 )0x0001U )

/* See chapter F24(18.5.13) / F25(19.5.13) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_TMIDH_TMIDE           ( ( uint16 )0x8000U )
#define CAN_70_RL78F2X_MASK_TMIDH_TMRTR           ( ( uint16 )0x4000U )
#define CAN_70_RL78F2X_MASK_TMIDH_THLEN           ( ( uint16 )0x2000U )
#define CAN_70_RL78F2X_MASK_TMIDH_TMID_H          ( ( uint16 )0x1FFFU )
#define CAN_70_RL78F2X_MASK_TMIDL_TMID_L          ( ( uint16 )0xFFFFU )

/* See chapter F24(18.5.14) / F25(19.5.14) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_TMPTRH_TMDLC          ( ( uint16 )0xF000U )
 
/* See chapter F24(18.5.15) / F25(19.5.15) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_TMFDCTRH_TMPTR        ( ( uint16 )0xFFFFU )
#define CAN_70_RL78F2X_MASK_TMFDCTRL_TMIFL        ( ( uint16 )0x0300U )
#define CAN_70_RL78F2X_MASK_TMFDCTRL_TMFDF        ( ( uint16 )0x0004U )
#define CAN_70_RL78F2X_MASK_TMFDCTRL_TMBRS        ( ( uint16 )0x0002U )
#define CAN_70_RL78F2X_MASK_TMFDCTRL_TMESI        ( ( uint16 )0x0001U )

/* See chapter F24(18.5.16) / F25(19.5.16) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_TMDF_TMDB             ( ( uint16 )0xFFFFU )

/* See chapter F24(28.3.4) / F25(29.3.4) of the hardware manual. */
#define CAN_70_RL78F2X_MASK_CFDECCTL_EMCA_W_EN    ( ( uint16 )0x4000U )
#define CAN_70_RL78F2X_MASK_CFDECCTL_ECERVF       ( ( uint16 )0x0040U )
#define CAN_70_RL78F2X_MASK_CFDECCTL_EC2EDIC      ( ( uint16 )0x0010U )

/* -------------------------------------------------------------------------- */

/* C0CTRL register bit value. */
#define CAN_70_RL78F2X_BIT_C0CTRL_CHMDC_RESET     ( ( uint16 )0x0001U )

/* CFDGRWC register bit value. */
#define CAN_70_RL78F2X_BIT_CFDGRWC_KEY_VALUE      ( ( uint16 )0xC400U )
#define CAN_70_RL78F2X_BIT_CFDGRWC_RPAGE_0        ( ( uint16 )0x0000U )
#define CAN_70_RL78F2X_BIT_CFDGRWC_RPAGE_1        ( ( uint16 )0x0001U )

/* TMSTS_ register bit value. */
#define CAN_70_RL78F2X_BIT_TMSTS_TMTRF_NOREQ      ( ( uint8 )0x00U )
#define CAN_70_RL78F2X_BIT_TMSTS_TMTRF_ABORT      ( ( uint8 )0x02U )
#define CAN_70_RL78F2X_BIT_TMSTS_TMTRF_SENT       ( ( uint8 )0x04U )
#define CAN_70_RL78F2X_BIT_TMSTS_TMTRF_SENT_ABORT ( ( uint8 )0x06U )

/* GCFGL register bit value. */
#define CAN_70_RL78F2X_BIT_GCFGL_TSP              ( ( uint16 )0x0F00U ) /* 32768 */

/* GAFLP1L register bit value. */
#define CAN_70_RL78F2X_BIT_GAFLP1L_GAFLFDP_0      ( ( uint16 )0x0001U ) /* RX FIFO 0 */
#define CAN_70_RL78F2X_BIT_GAFLP1L_GAFLFDP_1      ( ( uint16 )0x0002U ) /* RX FIFO 1 */

/* CFDWINR register bit value. */
#define CAN_70_RL78F2X_BIT_CFDWINR_CSEL0_CAN0     ( ( uint8 )0x00U )    /* 0b: CAN0 selected */
#define CAN_70_RL78F2X_BIT_CFDWINR_CSEL0_CAN1     ( ( uint8 )0x01U )    /* 1b: CAN1 selected */

/*----------------------------------------------------------------------------*/
/* type definitions                                                           */
/*----------------------------------------------------------------------------*/

