NguyenPhiHao/RL78F25/Sample_App_Lin/QINeS_MCAL/src/Mcal/Can/include/Can_70_RL78F2X_HwReg.h
typedef struct {
    volatile uint8     IF ;         /* FFFE0H, FFFE1H, FFFE2H, FFFE3H, FFFD0H, FFFD1H, FFFD2H, FFFD3H */
} Can_70_RL78F2X_RegIfxType;

typedef struct {
    volatile uint8     MK ;         /* FFFE4H, FFFE5H, FFFE6H, FFFE7H, FFFD4H, FFFD5H, FFFD6H, FFFD7H */
} Can_70_RL78F2X_RegMkxType;

typedef struct {
    volatile uint16    C0NCFGL;     /* F0300H */
    volatile uint16    C0NCFGH;     /* F0302H */
    volatile uint16    C0CTRL;      /* F0304H */
    volatile uint16    C0CTRH;      /* F0306H */
    volatile uint16    C0STSL;      /* F0308H */
    volatile uint16    C0STSH;      /* F030AH */
    volatile uint16    C0ERFLL;     /* F030CH */
    volatile uint16    C0ERFLH;     /* F030EH */
} Can_70_RL78F2X_RegCommonAType;

typedef struct {
    volatile uint16    GIPVL;       /* F0310H */
    volatile uint16    GIPVH;       /* F0312H */
    volatile uint16    GCFGL;       /* F0314H */
    volatile uint16    GCFGH;       /* F0316H */
    volatile uint16    GCTRL;       /* F0318H */
    volatile uint16    GCTRH;       /* F031AH */
    volatile uint16    GSTS;        /* F031CH */
    volatile uint8     dummy1[2];   /* F031EH */
    volatile uint16    GERFLL;      /* F0320H */
    volatile uint16    GERFLH;      /* F0322H */
    volatile uint16    GTSC;        /* F0324H */
    volatile uint8     dummy2[2];   /* F0326H */
    volatile uint16    GAFLECTR;    /* F0328H */
    volatile uint8     dummy3[4];   /* F032AH */
    volatile uint16    GAFLCFG;     /* F032EH */
    volatile uint16    RMNB;        /* F0330H */
    volatile uint8     dummy4[2];   /* F0332H */
    volatile uint16    RMND;        /* F0334H */
    volatile uint8     dummy5[2];   /* F0336H */
    volatile uint16    RMIEC;       /* F0338H */
} Can_70_RL78F2X_RegCommonBType;

typedef struct {
    volatile uint16    RFCC;        /* F033CH, F0340H */
    volatile uint8     dummy1[6];   /* F033EH, F0342H */
    volatile uint16    RFSTS;       /* F0344H, F0348H */
    volatile uint8     dummy2[6];   /* F0346H, F034AH */
    volatile uint16    RFPCTR;      /* F034CH, F0350H */
} Can_70_RL78F2X_RegCommonCType;

typedef struct {
    volatile uint16    FESTS;       /* F0360H */
    volatile uint8     dummy1[2];   /* F0362H */
    volatile uint16    FFSTS;       /* F0364H */
    volatile uint8     dummy2[2];   /* F0366H */
    volatile uint16    FMSTS;       /* F0368H */
    volatile uint8     dummy3[2];   /* F036AH */
    volatile uint16    RFISTS;      /* F036CH */
} Can_70_RL78F2X_RegCommonDType;

typedef struct {
    volatile uint8     TMC[4];      /* F0370H, F0371H, F0372H, F0373H */
    volatile uint8     TMSTS[4];    /* F0374H, F0375H, F0376H, F0377H */
} Can_70_RL78F2X_RegCommonEType;

typedef struct {
    volatile uint16    TMTRSTS;     /* F0378H, (F037AH) */
    volatile uint8     dummy1[2];   /* F037AH, (F037CH) */
    volatile uint16    TMTARSTS;    /* F037CH, (F037EH) */
    volatile uint8     dummy2[2];   /* F037EH, (F0380H) */
    volatile uint16    TMTCSTS;     /* F0380H, (F0382H) */
    volatile uint8     dummy3[2];   /* F0382H, (F0384H) */
    volatile uint16    TMTASTS;     /* F0384H, (F0386H) */
    volatile uint8     dummy4[2];   /* F0386H, (F0388H) */
    volatile uint16    TMIEC;       /* F0388H, (F038AH) */
} Can_70_RL78F2X_RegCommonFType;

typedef struct {
    volatile uint16    THLCC;       /* F0398H, (F039AH) */
    volatile uint8     dummy1[2];   /* F039AH, (F039CH) */
    volatile uint16    THLSTS;      /* F039CH, (F039EH) */
    volatile uint8     dummy2[2];   /* F039EH, (F03A0H) */
    volatile uint16    THLPCTR;     /* F03A0H, (F03A2H) */
    volatile uint8     dummy3[2];   /* F03A2H, (F03A4H) */
    volatile uint16    GTINTSTS;    /* F03A4H, (F03A6H) */
} Can_70_RL78F2X_RegCommonGType;

typedef struct {
    volatile uint16    GFDCFG;      /* F03B0H */
} Can_70_RL78F2X_RegCommonHType;

typedef struct {
    volatile uint16    GRSTC;       /* F03D8H */
    volatile uint8     dummy1[2];   /* F03DAH */
    volatile uint16    CFDGRWC;     /* F03DCH */
} Can_70_RL78F2X_RegCommonIType;

typedef struct {
    volatile uint16    C0DCFGL;     /* F0400H */
    volatile uint16    C0DCFGH;     /* F0402H */
    volatile uint16    C0FDCFGL;    /* F0404H */
    volatile uint16    C0FDCFGH;    /* F0406H */
    volatile uint16    C0FDCTRL;    /* F0408H */
    volatile uint16    C0FDCTRH;    /* F040AH */
    volatile uint16    C0FDSTSL;    /* F040CH */
    volatile uint16    C0FDSTSH;    /* F040EH */
    volatile uint16    C0FDCRCL;    /* F0410H */
    volatile uint16    C0FDCRCH;    /* F0412H */
} Can_70_RL78F2X_RegCommonJType;

typedef struct {
    volatile uint16    GAFLIDL;     /* F0420H, F0420H+(10H*i)[i=0-15], F0510H */
    volatile uint16    GAFLIDH;     /* F0422H, F0422H+(10H*i)[i=0-15], F0512H */
    volatile uint16    GAFLML;      /* F0424H, F0424H+(10H*i)[i=0-15], F0514H */
    volatile uint16    GAFLMH;      /* F0426H, F0426H+(10H*i)[i=0-15], F0516H */
    volatile uint16    GAFLP0L;     /* F0428H, F0428H+(10H*i)[i=0-15], F0518H */
    volatile uint16    GAFLP0H;     /* F042AH, F042AH+(10H*i)[i=0-15], F051AH */
    volatile uint16    GAFLP1L;     /* F042CH, F042CH+(10H*i)[i=0-15], F051CH */
} Can_70_RL78F2X_RegPage0AType;

typedef struct {
    volatile uint16    RFIDL;       /* F0420H, F046CH */
    volatile uint16    RFIDH;       /* F0422H, F046EH */
    volatile uint16    RFPTRL;      /* F0424H, F0470H */
    volatile uint16    RFPTRH;      /* F0426H, F0472H */
    volatile uint16    RFFDSTSL;    /* F0428H, F0474H */
    volatile uint16    RFFDSTSH;    /* F042AH, F0476H */
} Can_70_RL78F2X_RegPage1AType;

typedef struct {
    volatile uint8     RFDF[ CAN_70_RL78F2X_RXDATAFIELD_MAX ]; /* F042CH, F042CH+(4CH*k)+(4*p)[k=0-1,p=0-15], F04B8H */
} Can_70_RL78F2X_RegPage1BType;

typedef struct {
    volatile uint16    TMIDL;       /* F0504H, F0550H, F059CH, F05E8H */
    volatile uint16    TMIDH;       /* F0506H, F0552H, F059EH, F05EAH */
    volatile uint8     dummy1[2];   /* F0508H, F0554H, F05A0H, F05ECH */
    volatile uint16    TMPTRH;      /* F050AH, F0556H, F05A2H, F05EEH */
    volatile uint16    TMFDCTRL;    /* F050CH, F0558H, F05A4H, F05F0H */
    volatile uint16    TMFDCTRH;    /* F050EH, F055AH, F05A6H, F05F2H */
} Can_70_RL78F2X_RegPage1CType;

