NguyenPhiHao/RL78F25/Sample_App_Lin/QINeS_MCAL/src/Mcal/Can/include/Can_70_RL78F2X_HwReg.h
typedef struct {
    volatile uint8     TMDF[ CAN_70_RL78F2X_TXDATAFIELD_MAX ]; /* F0510H, F0510H+(4CH*m)+(4*p)[m=0-3,p=0-15], F067EH */
} Can_70_RL78F2X_RegPage1DType;

typedef struct {
    volatile uint16    THLACC0L;    /* F0640H */
    volatile uint16    THLACC0H;    /* F0642H */
    volatile uint16    THLACC1L;    /* F0644H */
    volatile uint16    THLACC1H;    /* F0646H */
} Can_70_RL78F2X_RegPage1EType;

typedef struct {
    volatile uint16    CFDECCTL;    /* F07C0H */
} Can_70_RL78F2X_RegCfdecctlType;

typedef struct {
    Can_70_RL78F2X_RegCommonAType*       RegCommonA;
    Can_70_RL78F2X_RegCommonEType*       RegCommonE;
    Can_70_RL78F2X_RegCommonFType*       RegCommonF;
    Can_70_RL78F2X_RegCommonGType*       RegCommonG;
    Can_70_RL78F2X_RegCommonJType*       RegCommonJ;
    Can_70_RL78F2X_RegPage1CType*        RegPage1C[ CAN_70_RL78F2X_TXBUFFER_MAX ];
    Can_70_RL78F2X_RegPage1DType*        RegPage1D[ CAN_70_RL78F2X_TXBUFFER_MAX ];
    Can_70_RL78F2X_RegPage1EType*        RegPage1E;
} Can_70_RL78F2X_CanChannelRegInfoType;

typedef struct {
    Can_70_RL78F2X_RegIfxType*           RegIfx[ CAN_70_RL78F2X_INTERRUPT_FLAG_MAX ];
    Can_70_RL78F2X_RegMkxType*           RegMkx[ CAN_70_RL78F2X_INTERRUPT_FLAG_MAX ];
    Can_70_RL78F2X_RegCommonBType*       RegCommonB;
    Can_70_RL78F2X_RegCommonCType*       RegCommonC[ CAN_70_RL78F2X_RXFIFO_MAX ];
    Can_70_RL78F2X_RegCommonDType*       RegCommonD;
    Can_70_RL78F2X_RegCommonHType*       RegCommonH;
    Can_70_RL78F2X_RegCommonIType*       RegCommonI;
    Can_70_RL78F2X_RegPage0AType*        RegPage0A[ CAN_70_RL78F2X_AFL_MAX ];
    Can_70_RL78F2X_RegPage1AType*        RegPage1A[ CAN_70_RL78F2X_RXFIFO_MAX ];
    Can_70_RL78F2X_RegPage1BType*        RegPage1B[ CAN_70_RL78F2X_RXFIFO_MAX ];
    Can_70_RL78F2X_RegCfdecctlType*      RegCfdecctl;
    Can_70_RL78F2X_CanChannelRegInfoType ChannelRegInfo[ CAN_70_RL78F2X_CHANNEL_MAX ];
} Can_70_RL78F2X_CanControllerRegInfoType;

/*----------------------------------------------------------------------------*/
/* external variables                                                         */
/*----------------------------------------------------------------------------*/
extern volatile const Can_70_RL78F2X_CanControllerRegInfoType Can_70_CanControllerRegInfo[ CAN_70_NUM_OF_CAN_CHANNEL ];
extern const Can_70_InterruptBitAssignType Can_70_InterruptBitAssign[ CAN_70_NUM_OF_CAN_CHANNEL ];

#endif  /* #ifndef CAN_70_RL78F2X_HWREG_H */

/* EOF Can_70_RL78F2X_HwReg.h *************************************************/